coocox/Mplib/Toshaba/TMPM36x/TMPM363/cmsis_lib/lib/source/tmpm363_cg.c
    regval &= CG_WUP_TIME_MASK;
    regval &= CG_WUP_COUNTER_MASK;
    if (Source == CG_WARM_UP_SRC_X1) {
        /* Check the parameters */
        assert_param(IS_CG_WARM_UP_TIME_X1(Time));
        tmp = Time;
        tmp = tmp << 20U;
        regval |= tmp;
        regval |= WARM_UP_SEL_X1;
    } else {
        /* Check the parameters */
        assert_param(IS_CG_WARM_UP_TIME_XT1(Time));

        /* get low 2 bits of warm-up time */
        tmp = Time;
        tmp = (tmp & 0x3U) << 14U;
        regval |= tmp;

        /* get high 12 bits of warm-up time */
        tmp = Time;
        tmp = (tmp & 0x3ffcU) << 18U;
        regval |= tmp;
        regval |= WARM_UP_SEL_XT1;
    }
    TSB_CG->OSCCR = regval;
}

/**
  * @brief  start operation of warm up timer for oscillator .
  * @param  none
  * @retval none
  */
void CG_StartWarmUp(void)
{
    TSB_CG_OSCCR_WUEON = 1U;
}

/**
  * @brief check whether warm up is completed or not.
  * @param none
  * @retval warm-up state: completed or not
  *   The value returned can be one of the following values:
  *   DONE or BUSY.
  */
WorkState CG_GetWarmUpState(void)
{
    WorkState state = BUSY;

    if (TSB_CG_OSCCR_WUEF == 0U) {
        state = DONE;
    } else {
        /*Do nothing */
    }
    return state;
}

/**
  * @brief  enable PLL or disable it.
  * @param  NewState:enable or disable
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE.
  * @retval result:success or not
  *   The value returned can be one of the following values:
  *   SUCCESS or ERROR.
  */
Result CG_SetPLL(FunctionalState NewState)
{
    Result retval = ERROR;
    CG_FcSrc fcsrc = CG_FC_SRC_FPLL;

    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        TSB_CG_OSCCR_PLLON = 1U;
        retval = SUCCESS;
    } else {
        fcsrc = CG_GetFcSrc();
        if (fcsrc == CG_FC_SRC_FOSC) {  /* PLL is not used.So it can be shut off */
            /* set register to disable PLL */
            TSB_CG_OSCCR_PLLON = 0U;
            retval = SUCCESS;
        } else {                /*fcsrc == CG_FC_SRC_FPLL. PLL is in use, so disabling it should be invalid */
            retval = ERROR;
        }
    }
    return retval;
}

/**
  * @brief  get the status of PLL operation
  * @param  none
  * @retval pll state: run or stop
  *   The value returned can be one of the following values:
  *   ENABLE or DISABLE.
  */
FunctionalState CG_GetPLLState(void)
{
    FunctionalState pllstate = DISABLE;

    if (TSB_CG_OSCCR_PLLON == 1U) {
        pllstate = ENABLE;
    } else {
        /*Do nothing */
    }
    return pllstate;
}

/**
  * @brief  enable or disable high-speed oscillation (fosc)
  * @param  NewState: oscillation is enabled or disabled
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE.
  * @retval success or failure
  *   The value returned can be one of the following values:
  *   SUCCESS or ERROR.
  */
Result CG_SetFosc(FunctionalState NewState)
{
    CG_FsysSrc fsys_src = CG_FSYS_SRC_FGEAR;
    Result retval = ERROR;

    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* enable high-speed oscillation */
        TSB_CG_OSCCR_XEN = 1U;
        retval = SUCCESS;
    } else {
        fsys_src = CG_GetFsysSrc();
        if (fsys_src == CG_FSYS_SRC_FGEAR) {    /* fosc is in  use. so it can't be disabled */
            retval = ERROR;
        } else {
            /* disable high-speed oscillation */
            TSB_CG_OSCCR_XEN = 0U;
            retval = SUCCESS;
        }
    }
    return retval;
}

/**
  * @brief  get the state of high-speed oscillation (fosc)
  * @param  none
  * @retval state of fosc
  *   The value returned can be one of the following values:
  *   DISABLE or ENABLE.
  */
FunctionalState CG_GetFoscState(void)
{
    FunctionalState state = DISABLE;

    if (TSB_CG_OSCCR_XEN == 1U) {
        state = ENABLE;
    } else {
        /*Do nothing */
    }
    return state;
}

/**
  * @brief  enable or disable low-speed oscillation (fs)
  * @param  NewState: oscillation is enabled or disabled
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE.
  * @retval success or failure
  *   The value returned can be one of the following values:
  *   SUCCESS or ERROR.
  */
Result CG_SetFs(FunctionalState NewState)
{
    CG_FsysSrc fsys_src = CG_FSYS_SRC_FGEAR;
    Result retval = ERROR;

    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* enable low-speed oscillation */
        TSB_CG_OSCCR_XTEN = 1U;
        retval = SUCCESS;
    } else {
        fsys_src = CG_GetFsysSrc();
        if (fsys_src == CG_FSYS_SRC_FS) {
            /* fs is in  use. so it can't be disabled */
            retval = ERROR;
        } else {
            /* disable low-speed oscillation */
            TSB_CG_OSCCR_XTEN = 0U;
            retval = SUCCESS;
        }
    }
    return retval;
}

/**
  * @brief  get the state of low-speed oscillation (fs)
  * @param  none
  * @retval state of fs
  *   The value returned can be one of the following values:
  *   DISABLE or ENABLE.
  */
FunctionalState CG_GetFsState(void)
{
    FunctionalState state = DISABLE;

    if (TSB_CG_OSCCR_XTEN == 1U) {
        state = ENABLE;
    } else {
        /*Do nothing */
    }
    return state;
}

/**
  * @brief  set to the specified low-power mode
  * @param  low power mode
  *   The value can be one of the following values:
  *   CG_STBY_MODE_STOP, CG_STBY_MODE_SLEEP, CG_STBY_MODE_IDLE2, 
  *   CG_STBY_MODE_BACKUP_STOP(for M361, M362, M363, M364 only),
  *   CG_STBY_MODE_BACKUP_SLEEP(for M361, M362, M363, M364 only),
  *   CG_STBY_MODE_IDLE1.
  * @retval none
  */
void CG_SetSTBYMode(CG_STBYMode Mode)
{
    uint32_t regval = TSB_CG->STBYCR;

    /*check the parameter */
    assert_param(IS_CG_STBY_MODE(Mode));

    regval &= CG_STBY_MODE_MASK;
    regval |= (uint32_t) Mode;

    TSB_CG->STBYCR = regval;
}

/**
  * @brief  get the low-power consumption mode
  * @param  none
  * @retval low power mode
  *   The value returned can be one of the following values:
  *   CG_STBY_MODE_STOP, CG_STBY_MODE_SLEEP, CG_STBY_MODE_IDLE2,
  *   CG_STBY_MODE_BACKUP_STOP(for M361, M362, M363, M364 only), 
  *   CG_STBY_MODE_BACKUP_SLEEP(for M361, M362, M363, M364 only),
  *   CG_STBY_MODE_IDLE1 or CG_STBY_MODE_UNKNOWN.
  */
CG_STBYMode CG_GetSTBYMode(void)
{
    CG_STBYMode stby_mode = CG_STBY_MODE_UNKNOWN;
    uint8_t regval = (uint8_t) (TSB_CG->STBYCR & (~CG_STBY_MODE_MASK));

    stby_mode = numToSTBYMode_table[regval];
    return stby_mode;
}

/**
  * @brief  enables or disables fosc after releasing stop mode
  * @param  NewState: enable or disable
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE.
  * @retval none.
  */
void CG_SetExitStopModeFosc(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        TSB_CG_STBYCR_RXEN = 1U;
    } else {
        TSB_CG_STBYCR_RXEN = 0U;
    }
}

/**
  * @brief  get the state of fosc after releasing stop mode.
  * @param  none
  * @retval state of fosc after releasing stop mode
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE.
  */
FunctionalState CG_GetExitStopModeFoscState(void)
{
    FunctionalState state = DISABLE;

    if (TSB_CG_STBYCR_RXEN == 1U) {
        state = ENABLE;
    } else {
        /*Do nothing */
    }
    return state;
}

/**
  * @brief  enables or disables fs after releasing stop mode
  * @param  NewState: enable or disable
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE.
  * @retval none.
  */
void CG_SetExitStopModeFs(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        TSB_CG_STBYCR_RXTEN = 1U;
    } else {
        TSB_CG_STBYCR_RXTEN = 0U;
    }
}

/**
  * @brief  get the state of fs after releasing stop mode.
  * @param  none
  * @retval state of fs after releasing stop mode
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE.
  */
FunctionalState CG_GetExitStopModeFsState(void)
{
    FunctionalState state = DISABLE;

    if (TSB_CG_STBYCR_RXTEN == 1U) {
        state = ENABLE;
    } else {
        /*Do nothing */
    }
    return state;
}

/**
  * @brief  set pin status in stop mode
  * @param  NewState: enable or disable
  *   This parameter can be one of the following values:
  *   ENABLE or DISABLE.
  * @retval none.
  */
void CG_SetPinStateInStopMode(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        TSB_CG_STBYCR_DRVE = 1U;
    } else {
        TSB_CG_STBYCR_DRVE = 0U;
    }
}

/**
  * @brief  get pin status in stop mode
  * @param  none
  * @retval state of pin in stop mode
  *   The value returned can be one of the following values:
  *   DISABLE or ENABLE.
  */
FunctionalState CG_GetPinStateInStopMode(void)
{
    FunctionalState state = DISABLE;

    if (TSB_CG_STBYCR_DRVE == 1U) {
        /* pin status in stop mode is active */
        state = ENABLE;
    } else {
        state = DISABLE;
    }
    return state;
}

