coocox/Mplib/Toshaba/TMPM36x/TMPM363/cmsis_lib/lib/source/tmpm363_cg.c
#if defined(__TMPM361_CG_H) || defined(__TMPM362_CG_H) ||  \
    defined(__TMPM363_CG_H) || defined(__TMPM364_CG_H)
/**
  * @brief  set the IO port control in the backup mode as controllable or Hold on.
  * @param  NewState:ENABLE or DISABLE
  * @retval success or failure
  *   The value returned can be one of the following values:
  *   SUCCESS or ERROR.
  */
Result CG_SetPortKeep(FunctionalState NewState)
{
    Result retval = ERROR;

    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    if (NewState == ENABLE) {
        /*Holds the I/O Port setting in the Backup Mode by <DRVE>="1". */
        if (CG_GetPinStateInStopMode() == ENABLE) {
            TSB_CG_STBYCR_PTKEEP = 1U;
            retval = SUCCESS;
        } else {
            /* Do nothing */
            /* ERROR */
        }
    } else {
        TSB_CG_STBYCR_PTKEEP = 0U;
        retval = SUCCESS;
    }
    return (retval);
}
#endif

/**
  * @brief  set the source of fc
  * @param  Source:  the source of fc
  *   This parameter can be one of the following values:
  *   CG_FC_SRC_FOSC or CG_FC_SRC_FPLL.
  * @retval success or failure
  *   The value returned can be one of the following values:
  *   SUCCESS or ERROR.
  */
Result CG_SetFcSrc(CG_FcSrc Source)
{

    Result retval = ERROR;
    FunctionalState fosc_on = DISABLE;
    FunctionalState pllon = DISABLE;

    /* Check the parameters */
    assert_param(IS_CG_FC_SRC(Source));

    fosc_on = CG_GetFoscState();
    if (fosc_on == ENABLE) {
        if (Source == CG_FC_SRC_FOSC) {
            TSB_CG_PLLSEL_PLLSEL = 0U;
            retval = SUCCESS;
        } else {
            pllon = CG_GetPLLState();
            if (pllon == ENABLE) {
                TSB_CG_PLLSEL_PLLSEL = 1U;
                retval = SUCCESS;
            } else {
                retval = ERROR;
            }
        }
    } else {
        retval = ERROR;
    }
    return retval;
}

/**
  * @brief  get the source of fc
  * @param  none
  * @retval the source of fc
  *   The value returned can be one of the following values:
  *   CG_FC_SRC_FOSC or CG_FC_SRC_FPLL.
  */
CG_FcSrc CG_GetFcSrc(void)
{
    CG_FcSrc fcsrc = CG_FC_SRC_FOSC;

    if (TSB_CG_PLLSEL_PLLSEL == 1U) {
        fcsrc = CG_FC_SRC_FPLL;
    } else {
        /*Do nothing */
    }
    return fcsrc;
}

/**
  * @brief  set the times that clock is multiplied by the PLL.
  * @param  MulTimes:: select the times of clock multiplied by the PLL.
  *     This parameter can be one of the following values:
  *     CG_MUL_4TIMES, CG_MUL_8TIMES
  * @retval none
  */
void CG_SetClkMulTimes(CG_ClkMul MulTimes)
{
    uint32_t regval = 0U;
    regval = TSB_CG->PLLSEL;
    regval &= CG_MUL_TIMES_MASK;

    /* Check the parameters */
    assert_param(IS_CG_CLK_MUL(MulTimes));

    if (MulTimes == CG_MUL_8TIMES) {
        regval |= CG_MUL_8TIMES_DATA;
    } else {
        regval |= CG_MUL_4TIMES_DATA;
    }
    TSB_CG->PLLSEL = regval;
}

/**
  * @brief  set the source of fsys
  * @param  Source: Source: select the source of fsys
  *   This parameter can be one of the following values:
  *   CG_FSYS_SRC_FGEAR or CG_FSYS_SRC_FS.
  * @retval success or failure
  *   The value returned can be one of the following values:
  *   SUCCESS or ERROR.
  */
Result CG_SetFsysSrc(CG_FsysSrc Source)
{
    Result retval = ERROR;
    FunctionalState fosc_on = DISABLE;
    FunctionalState fs_on = DISABLE;
    CG_FsysSrc fsyssrc;

    /* Check the parameters */
    assert_param(IS_CG_FSYS_SRC(Source));

    if (Source == CG_FSYS_SRC_FGEAR) {
        fosc_on = CG_GetFoscState();
        if (fosc_on == ENABLE) {
            /* set sysckl to fgear */
            TSB_CG_CKSEL_SYSCK = 0U;
            do {
                fsyssrc = CG_GetFsysSrc();
            } while (fsyssrc != CG_FSYS_SRC_FGEAR);
            retval = SUCCESS;
        } else {
            retval = ERROR;
        }
    } else {
        fs_on = CG_GetFsState();
        if (fs_on == ENABLE) {
            /* set sysckl to fs */
            TSB_CG_CKSEL_SYSCK = 1U;
            do {
                fsyssrc = CG_GetFsysSrc();
            } while (fsyssrc != CG_FSYS_SRC_FS);
            retval = SUCCESS;
        } else {
            retval = ERROR;
        }
    }
    return retval;
}

/**
  * @brief  get the clock source of fsys
  * @param  none
  * @retval source of fsys
  *   The value returned can be one of the following values:
  *   CG_FSYS_SRC_FGEAR or CG_FSYS_SRC_FS.
  */
CG_FsysSrc CG_GetFsysSrc(void)
{
    CG_FsysSrc fsyssrc = CG_FSYS_SRC_FGEAR;

    if (TSB_CG_CKSEL_SYSCKFLG == 1U) {
        fsyssrc = CG_FSYS_SRC_FS;
    } else {
        /*Do nothing */
    }
    return fsyssrc;
}

/**
  * @brief  setup the INT source for releasing low power mode.
  * @param  INTSource: select the release INT source
  *   This parameter can be one of the following values:
  *   CG_INT_SRC_0, CG_INT_SRC_1, CG_INT_SRC_2, CG_INT_SRC_3,     
  *   CG_INT_SRC_4, CG_INT_SRC_5, CG_INT_SRC_6, CG_INT_SRC_7, 
  *   CG_INT_SRC_8(For M360/M362/M364), CG_INT_SRC_9(For M360/M362/M364),
  *   CG_INT_SRC_A(For M360/M362/M364), CG_INT_SRC_B(For M360/M362/M364), 
  *   CG_INT_SRC_C(For M360/M362/M364), CG_INT_SRC_D(For M360/M362/M364),
  *   CG_INT_SRC_E(For M360/M361/M362), CG_INT_SRC_F(For M360/M361/M362), 
  *   CG_INT_SRC_CEC_RX , CG_INT_SRC_CEC_TX, CG_INT_SRC_RMC_RX_0,  
  *   CG_INT_SRC_RMC_RX_1(For M360/M362/M364), CG_INT_SRC_RTC, CG_INT_SRC_KWUP.
  * @param  ActiveState: select the active state for release trigger
  *   For INTCECRX, INTCECTX, INTRMCRX0 and INTRMCRX1, only "RISING" state will be set,
  *   no matter what the value of ActiveState is.
  *   For INTRTC , only "FALLING" state will be set, no matter what the value of ActiveState is.
  *   For INTKWUP, only "H level" state will be set, no matter what the value of ActiveState is.
  *   Others  parameter can be one of the following values:
  *   CG_INT_ACTIVE_STATE_L, CG_INT_ACTIVE_STATE_H, CG_INT_ACTIVE_STATE_FALLING,
  *   CG_INT_ACTIVE_STATE_RISING or CG_INT_ACTIVE_STATE_BOTH_EDGES.
  * @param  NewState: enable or disable this release trigger
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE.
  * @retval none
  */
void CG_SetSTBYReleaseINTSrc(CG_INTSrc INTSource,
                             CG_INTActiveState ActiveState, FunctionalState NewState)
{
    uint32_t num = 0U;
    uint8_t i = 0U;
    uint8_t j = 0U;
    CG_Byte4 regval[6] = { {0U}
    , {0U}
    , {0U}
    , {0U}
    , {0U}
    , {0U}
    };

    /* Check the parameters */
    assert_param(IS_CG_INT_SRC(INTSource));
    assert_param(IS_CG_INT_ACTIVE_STATE(ActiveState));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (INTSource <= CG_INT_SRC_KWUP) {

        num = (uint32_t) INTSource;
        i = (uint8_t) (num / 4U);
        j = (uint8_t) (num % 4U);

        switch (i) {
        case 0:                /* IMCGA */
            regval[0].byte4 = TSB_CG->IMCGA;
            regval[0].byte[j] &= 0x8eU;
            regval[0].byte[j] |= ActiveState;
            TSB_CG->IMCGA = regval[0].byte4;
            regval[0].byte[j] |= NewState;
            TSB_CG->IMCGA = regval[0].byte4;
            break;

        case 1:                /* IMCGB */
            regval[1].byte4 = TSB_CG->IMCGB;
            regval[1].byte[j] &= 0x8eU;
            regval[1].byte[j] |= ActiveState;
            TSB_CG->IMCGB = regval[1].byte4;
            regval[1].byte[j] |= NewState;
            TSB_CG->IMCGB = regval[1].byte4;
            break;

#if defined(__TMPM360_CG_H) || defined(__TMPM362_CG_H) || defined(__TMPM364_CG_H)
        case 2:                /* IMCGC */
            regval[2].byte4 = TSB_CG->IMCGC;
            regval[2].byte[j] &= 0x8eU;
            regval[2].byte[j] |= ActiveState;
            TSB_CG->IMCGC = regval[2].byte4;
            regval[2].byte[j] |= NewState;
            TSB_CG->IMCGC = regval[2].byte4;
            break;
#endif

